

**Question 7.** 

Using the data from Question 4, write code to analyze the data and answer the following questions. 

Note -
1. Draw plots to demonstrate the analysis for the following questions for better visualizations. 
2. Write code comments wherever required for code understanding. 

Insights to be drawn - 
- Get all the Earth meteorites that fell before the year 2000
- Get all the earth meteorites co-ordinates who fell before the year 1970
- Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more than 10000kg

In [1]:
import numpy as np
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt 
%matplotlib inline 
pd.set_option('display.max_columns', None)

In [2]:
df = pd.read_csv('Meteorite.csv')

In [3]:
df.head()

,Unnamed: 0,name,id,nametype,recclass,mass,year,reclat,reclong,Geo-Coordinates
0,0,Aachen,1,Valid,L5,21.0,1880-01-01,50.77500,6.08333,"[6, 6]"
1,1,Aarhus,2,Valid,H6,720.0,1951-01-01,56.18333,10.23333,"[10, 10]"
2,2,Abee,6,Valid,EH4,107000.0,1952-01-01,54.21667,-113.00000,"[-113, -113]"
3,3,Acapulco,10,Valid,Acapulcoite,1914.0,1976-01-01,16.88333,-99.90000,"[-99, -99]"
4,4,Achiras,370,Valid,L6,780.0,1902-01-01,-33.16667,-64.95000,"[-64, -64]"

In [4]:
df.shape

(1000, 10)

In [5]:
df.columns

Index(['Unnamed: 0', 'name', 'id', 'nametype', 'recclass', 'mass', 'year',
       'reclat', 'reclong', 'Geo-Coordinates'],
      dtype='object')

In [6]:
df.drop(labels = 'Unnamed: 0', axis = 1,  inplace = True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   name             1000 non-null   object
 1   id               1000 non-null   int64
 2   nametype         1000 non-null   object
 3   recclass         1000 non-null   object
 4   mass             972 non-null    float64
 5   year             982 non-null    object
 6   reclat           988 non-null    float64
 7   reclong          988 non-null    float64
 8   Geo-Coordinates  1000 non-null   object
dtypes: float64(3), int64(1), object(5)
memory usage: 70.4+ KB

In [8]:
df.describe()

                id          mass      reclat     reclong
count   1000.00000  9.720000e+02  988.000000  988.000000
mean   15398.72800  5.019020e+04   29.691592   19.151208
std    10368.70402  7.539857e+05   23.204399   68.644015
min        1.00000  1.500000e-01  -44.116670 -157.866670
25%     7770.50000  6.795000e+02   21.300000   -5.195832
50%    12757.50000  2.870000e+03   35.916665   17.325000
75%    18831.25000  1.005000e+04   45.817835   76.004167
max    57168.00000  2.300000e+07   66.348330  174.400000

In [9]:
df.isnull().sum()

name                0
id                  0
nametype            0
recclass            0
mass               28
year               18
reclat             12
reclong            12
Geo-Coordinates     0
dtype: int64

In [10]:
df1 = df.copy()


### - Get all the Earth meteorites that fell before the year 2000

In [11]:
df1['year'][0].split('-')[0]

'1880'

In [12]:
df_met_before2000 = df1[df1['year'] < '2000-01-01']

In [13]:
df_met_before2000.head()

,name,id,nametype,recclass,mass,year,reclat,reclong,Geo-Coordinates
0,Aachen,1,Valid,L5,21.0,1880-01-01,50.77500,6.08333,"[6, 6]"
1,Aarhus,2,Valid,H6,720.0,1951-01-01,56.18333,10.23333,"[10, 10]"
2,Abee,6,Valid,EH4,107000.0,1952-01-01,54.21667,-113.00000,"[-113, -113]"
3,Acapulco,10,Valid,Acapulcoite,1914.0,1976-01-01,16.88333,-99.90000,"[-99, -99]"
4,Achiras,370,Valid,L6,780.0,1902-01-01,-33.16667,-64.95000,"[-64, -64]"

### - Get all the earth meteorites co-ordinates who fell before the year 1970

In [14]:
df1[df1['year'] < '1970-01-01']['Geo-Coordinates']

0            [6, 6]
1          [10, 10]
2      [-113, -113]
4        [-64, -64]
5          [71, 71]
           ...
994        [35, 35]
995        [79, 79]
997      [111, 111]
998      [106, 106]
999        [34, 34]
Name: Geo-Coordinates, Length: 763, dtype: object

### - Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more than 10000kg

In [15]:
df1[df1['mass']>10000]

,name,id,nametype,recclass,mass,year,reclat,reclong,Geo-Coordinates
2,Abee,6,Valid,EH4,107000.0,1952-01-01,54.21667,-113.00000,"[-113, -113]"
7,Agen,392,Valid,H5,30000.0,1814-01-01,44.21667,0.61667,"[0, 0]"
11,Aïr,424,Valid,L6,24000.0,1925-01-01,19.08333,8.38333,"[8, 8]"
16,Akyumak,433,Valid,"Iron, IVA",50000.0,1981-01-01,39.91667,42.81667,"[42, 42]"
27,Alfianello,466,Valid,L6,228000.0,1883-01-01,45.26667,10.15000,"[10, 10]"
...,...,...,...,...,...,...,...,...,...
991,Tieschitz,23989,Valid,H/L3.6,28000.0,1878-01-01,49.60000,17.11667,"[17, 17]"
992,Tilden,23998,Valid,L6,74800.0,1927-01-01,38.20000,-89.68333,"[-89, -89]"
994,Timochin,24004,Valid,H5,65500.0,1807-01-01,54.50000,35.20000,"[35, 35]"
997,Tjabe,24011,Valid,H6,20000.0,1869-01-01,-7.08333,111.53333,"[111, 111]"
998,Tjerebon,24012,Valid,L5,16500.0,1922-01-01,-6.66667,106.58333,"[106, 106]"